direc = {"name": "moshe", "age": 34} # זה כמו רשימת מידע רק שזה אלמנט שווה אלמנט לדוגמא : יש רשימת תלמידים ויש רשימת תלמידים +הפרטים שלהם
print(direc["age"]) # בחירת המשתנה בכדי לקבל את העירך
# print(direc["moshe"]) # נקבל שגיאה בגלל שאין אלאמנט בשם משה ולכן תסתכל למטה ותראה שיטה יותר טובה נב אךל תוריד מהערות
# ויש שיטה יותר טובה שכך לא נקבל שגיאה אלא NONE
print(direc.get("moshe")) # במקרה הזה נקבל NONE כי משתנה בשם משה
direc["maor"] = 54 # שינוי והוספת ערך למשתנה וכן הוספת משתנה
#direc["name"] = "naor"# שינוי ערך של מתשנה קיים
print(direc)
# del direc["maor"] # מחיקת ערך קיים
#del direc ["name"] # מחיקת משתנה כולל ערך
print(direc)

