# mylist = [22,43,54,56]
# for i in mylist:
#     print(i)
# loop for to יוצר לולאה של המספרים
#איך רצים על רשימה בעזרת מיקום(אינדקס) שמשתנה?
# ומה שבעצם קרה פה ראשית יצרתי את הרשימה
maps = ["apple","banana","cherry"]
i =0 #זה שייך רק במידה ויצרתי WHILE
print(maps)
# לאחר מכן אני יצרתי שהרשימה תהיה שווה למספרים על פי השורות
for k in range(len(maps)):
    print(maps[k])
#אפשר גם עם לולרת while
#  בזמן שI קטן מהשורות של מפס
while i <len(maps):
    # תדפיס לי
    print(maps[i]) # שים לב ניתן ליצור בחירה רק  של משפט מסויים פשוט בתוך ה[] תכניס את המספר של השורה שבחרת
  # ואז I שווה למספר
    i += 1
# זה סיכום של קוד שיסדר לי לפי סדר מחרוזת של הפריטים
