# ראשית מה זה tuple ? זוהי רשימה שאינה משתנה ממש כמו ליסט רק שלא ניתן לשנות כלום והוא כמובן בסוגריים עגולות בוא ניצור אחד
my_tuple = (1,2,3,4,7) # יצרנו משתנה בשם MY טפל ונתנו לו ערכים שאינם משתנים
print(my_tuple[4])  #הדפס בבקשה ארת הטפל וביקשתי ממנו שורה ספציפית
# my_tuple.append(8) אם ננסה להוסיף \למחוק זה השגיאה שנקבל מופיעה לך למטה
# 'tuple' object has no attribute 'append'
print(2 in my_tuple)  # אני אומר לו בדוק אם  נמצא ברשימה ? והוא יענה לי אמת או שקר ניתן לעשות את זה גם עם סטרינג
print(my_tuple.index(4)) # תדפיס לי את המיקום
print(my_tuple.count(4)) # כמה פעמים המספר הזה בתוך הטפל
my_LIS = [32,34,57,87]
print(tuple(my_LIS)) # להפוך רשימה רגילה לרשימה קבועה