# # טווח של תווים מונע מאיתנו לכתוב אות אות בחיפוש
# #  מתי שאתה ^ זה תחילת מחרוזת
# # אפשר להוסיף עוד תנאי Quantifiersעם + ועם עו ד סוגים המופיעעים בטבלה מלטה
# *     אפס פעמים או יותר
# +     1 פעמים או יותר
# ?     0 פעמים או פעם אחת
#
# {3}   בדיוק 3 פעמים
# {3,8} בין 3 ל-8 פעמים
# {3,}  לפחות 3 פעמים
# {,8}  לכל היותר 8 פעמים
#
#
# כל אחד מהתווים המיוחדים יש את התו המציין את הסט המשלים שאותו מציינים באמצעות אות גדולה במקום הקטנה. לדוגמה, אם התו \d מציין את כל הספרות 0-9 אז את הסט המשלים נציין באמצעות \D שיציין את סט התווים שאינם 0-9.
# \W   כל תו שאינו אות באנגלית, מספר או קו תחתון (_)
#
# \D   כל תו שאינו ספרה
#
# \S   כל תו שאינו white space (לא רווח, לא טאב, לא שורה חדשה)
#
#
#
#
#
#
#
#
#
#
#
#
#
# # תווים מיוחדים !
# .    כל תו מלבד שורה חדשה
# \w   אותיות באנגלית קטנות וגדולות, מספרים וקו תחתון (_)
# \d   ספרה מ0-9
# \s   רווח לבן (white space) כמו רווח, טאב ושורה חדשה
# \b   גבול בין מילים (word boundary)
# $    סוף מחרוזת
# ^    תחילת מחרוזת
#
#
#
#
#
#
#
#
#
#
#
#
# # כאן יש טבלה של השימוש
# # [ab]        מa-b
# # [abc]       מa-c
# # [A-Z]       מA-Z
# # [a-z]       ma-z
# # [A-Za-z]    מA-Z או a-z
# # [0-9]       מ0-9
# # [A-Za-z0-9] מA-Z או a-z או 0-9
# # [א-ת]       מא-ת
# # [a-d]       ma-d
#
#
# כדי להחליף ביטוי אחד באחר נשתמש בפונקציה-re.sub.
#
# הקוד הבא מחליף את כל מה שאינו מספר במחרוזת ריקה, ומשאיר אותנו עם ספרות בלבד.
# import re
#
# only_numbers = re.sub(r'\D', '', '055-695-282-145-333')
# print(only_numbers)
#
#
# כמתים של ביטויים רגולריים נוטים להיות חמדנים ולמצוא התאמה רחבה יותר מכפי שהתכוונו. לדוגמה, בביטוי הבא יש שני אנשים. אני מעוניין להחליף את צבעם של האנשים בביטוי במחרוזת "SHEESH" באמצעות הקוד הבא:
#
#
# import re
#
# str = "said the <span>green</span> person to the <span>blue</span> person: GO HOME!"
#
# res = re.sub(r"<span>.+<\/span>", ' SHEESH ', str)
# print(res)



# 
#
# כולל את +? – וזה אומר חיפוש לא חמדני (Lazy)
# כלומר: הוא יתפוס כל תגית <span>...</span> בנפרד, ולא הכל יחד.
#
# import re
#
# str = "said the <span>green</span> person to the <span>blue</span> person: GO HOME!"
#
# res = re.sub(r"<span>.+?<\/span>", " SHEESH ", str)
# print(res)
