text = "baby"
print(text.upper())
# היום אנחנו נלמד על מתודות קודם כל מה זה ? ומה ההבדלים בין מתודה לפונקציה
# מתודה זה כמו פונקציה ניתן ליצור פעולה מסויימת ולקרוא לה במהירות אבל בשונה מפונקציה פונקציה היא על פעולות מתודה היא על אוןבייקטים או מחרוזות בלבד למחרוזות יש מתודות נפרדות למשל על טקסט
#print(text.upper())  #זה בעצם מתודה אשר  גורמת לטקסט להיות באותיות גדולות
# print(text.count("a")) # כמה פעמים יש תת מחרוזת
# print(text.find("y")) # מציג באיזה מיקום
#print(len(text)) # כמה אותיות  יש במחרוזת
#print(text[2]) # אפשר לקחת אות מסויימת ע"י לקיחת ערך ולוקחות את הערך בסוגריים מרובעות
#print(text[3:]) #שליפת כמה תווים מתוך המחרוזת למשל מהמקום ה3 ועד הסוף
#print(text[0:])# מהמקופ הראשון ועד הסוף
#print(text[-1])# זוהי ספירה מהסוף ככה אקבל את האות האחרונה זה אינדקס שלילי
#print(text[-4:]) #4 התווים האחרונים
#print(text.index("b")) # בשביל לדעת באיזה מקום נמצא התו
#ניתן לעשות גם תנאים וזה יותא פשוט אפילו
# if "a" in text: # תנאי שהתקיים עם זה נכון אז תעשה
#     print(text.upper())