
def say():
    word = "hi"
    print(word)
say()
#  זובי דוגמא לפונקציה עם משתנה מקומי ברגע שאני אלחץ על התוכני  רוצי אז זה יתן hi
# print(word) הסיבה שזה לא עבד ונתן שגיאה כי רק בפונקציה קיים משתנה בשם WORD אבל מחוץת לפונקציה לא קיים

#            מתי כן יווצר משתנה בשם WORD אם אני יצור אותו לפני הפונקציה לדוגמא
word = "bay" # יצרתי משתנה מראש משתנה לוקאלי ולא מקומי
def say():
    word = "hi"
    print(word)
say()
print(word) #ואז שאני קורא אני לא קורא למשתנה "היי" אלא ךמשתנה "ביי" כי קראתי לו מחוץ לפונקציה ואף אחד לא מכיר את המשתנה היי.

word = "Love"  # Global
#   אבל הפונקציה שלי לא מכירהב# זה יתן לי שגיאה כי אני מנסה להשתמש במשתנה חיצוני ומנסה לתת לו ערך של מתשנה מקומי
def say(word): # במידה ולא הייתי מייבא את זה הייתי מקבל שגיאה כמו שכתוב מעל שורה זו
    # global word # בלעדיו הייתה השגיאה למעלה
    word += " you"
    print(word)

say(word)
print(word)
# ישנפ שני פתרונות לבעייה זו דבר ראשון אני יכול לייבא את המשתנה החיצוני ואז בקוד שלי לעשות מה שאני רוצה פתרון 2. אפשר בלי לייבא לכתוב גלובאל ואז את שם המתשנה ואז הפונצקיה יודעצ שהוא גלובלי שים לב שזה לא  מה שבחרתי בסוף כי זה ריסקי ומסוכן