# today we are going to learn abut classes and object
# what is classes for  anyway ?
# יש לנו הרבה משתנים ואובייקטים עכשיו זה כמו פונקציה שילוב של הכל אבל זה מיועד בעיקר לפרוייקטין גדולים זה עוזר רבות לסדר והכל זה בעצם קוד של נושא מסויים למשל -תלמידים\מורים
# איך יוצרים מחלקה V
#class Person: # יצירת קלאס ואז נתינת שם לקלאס
# ישנם כמה חוקים בנתינת שם לקלאס
# 1.דבר ראשון את שם הקלאס כותבים באות גדולה בשונה מפונקציה שאפשר לעשות גם ום 2.ללא רוחוחים בין המילים
# מחלקות מכילות תכונות ומתודות
# תכונות אלו המתשנים שבתוך המחלקה מתודות זה הפונקציות המודה הנפוצה היא סלף שדכו ניתו לקרוא למחלקה
# INIT זוהי מתודה שהשימוש בה הוא כל פעם שניצור אובייקט
# class Student():
#     def __init__(self,name): # יצירת פונקציה יניט ונתינת אובייקט בשם סלף למשל אם נרצה להוסיף שם נכתוב כאו
#         print("this is the area for the object")
#         self.name = name # לשייך את האובייקט NAME לפונצקיה הזו ספציפית
#
#
# def main():
#     student = Student("moshe") #העברנו כאן את התוכן לפונקציה בשם MAIN אם נרצה להעביר אובייקט נכתוב
#     student2 = Student("YOshe")# ניתן גם לתת עוד אוביקטים למחלקה למשל כאן יצרתי עוד סטודנט בשם אחר
#     student.name = "oshe" # ניתן גם לשנות את האובייקט את הערך שנתתי לו אפילו שאני משתמש באובייקט מהמתודה ינטי
#     print(student.name) # מקרה הזה לאחר שקישרנו את המשתנה NAME לפונקציה אז ניתן להשתמש בו בפונקציה הזו
#     print(student2.name) # הדפס את האובייקט השני
#
# main() # עד כאן מדובר בפונקציה שמחוץ למחלקה מה נעשה אם נרצה להוסיף עוד פונקציה למחלקה


class Student:
    def __init__(self,name): # יצירת פונקציה יניט ונתינת אובייקט בשם סלף למשל אם נרצה להוסיף שם נכתוב כאו
        print("this is the area for the object")
        self.name = name # לשייך את האובייקט NAME לפונצקיה הזו ספציפית
    def say_hello(self): # יצירת מתודה נוספת עבור  תנאי
        opision = "good" if self.name == "John" else "bad"
        msg = "Hello im {} and my opision is {}".format(self.name,opision) # יצירת מתשנה בשם הנל בשביל להביא סטרינג + תכונה (משתנה)
        return msg # החזר את התכונה המכילה את שני התכונות

def main(): # יצירת מתודה שאיננה שייכת למחלקה
    student1 = Student("Johyn") # לקיחת ערך תכונה מהמחלקה ונתינת ערך
    print(student1.say_hello()) # הדפס את שני הדברים התכונה וכמובן הפונקציה הנוספת


main() # קריאה לפונקציה העיקרית !

# מהו מתשנה מחלקה  סטטי ומה ההבדל בינו לבין משתנה רגיל ניתן לראות  שלא משנה אם אנסה לשנות אותו הוא לא ישתנה כלל כי הוא משתנה סטטי
class MyStudent:
    class_V = 3 # נתינת ערך לתכונה
print(MyStudent.class_V) # הדפס תכונה מתוך
class_V = 7 # ניסיון נתינת ערך חדש
print(MyStudent.class_V) # הדפםס שוב
my_of = MyStudent() #יצירת אובייקט ולקיחה מהמחלקה
print(my_of.class_V) # הכדפס
# result = 3,3,3 כיוון שמדובר במשתנה קלאסי לא ניתן לשנות
